#!/usr/local/bin/python3
# -*- coding: utf-8 -*-
#------------------------------------------------------------------------------------------------
# Сбор статистики в файле о подключённых пользователях и их ip из OpenVPN
#------------------------------------------------------------------------------------------------

import os, sys

#------------------------------------------------------------------------------------------------

# Функция работы с файлами OpenVPN
def run():
  if os.path.isfile('/etc/openvpn/openvpn-status.log'):
    openvpnlog = open('/etc/openvpn/openvpn-status.log')
    else:
      pass

#------------------------------------------------------------------------------------------------

# Запуск программы
if __name__ =='__main__':
  run()
